#### RebarShapeVertexTurn Enumeration

---

|  |
| --- |
| See Also |

Specify whether a bend at a RebarShapeVertex represents a left or right turn.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum RebarShapeVertexTurn ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RebarShapeVertexTurn ``` |

| Visual C++ |
| --- |
| ``` public enum class RebarShapeVertexTurn ``` |

# Members

| Member name | Description |
| --- | --- |
| Right | A right turn. |
| Default | The turn value has not yet been set, or will not be used. |
| Left | A left turn. |

# See Also

Autodesk.Revit.DB.Structure Namespace